Сфера интересов: программирование, математика и смежные области.
Создаю полезные проекты и занимаюсь самообразованием.
Свободно владею английским.
Люблю делиться тем, что узнал.
Излагаю материал просто и наглядно в своих роликах и онлайн-учебниках. Мечтатель.

Создатель текстового процессора [Bitran](https://github.com/bitran-js/bitran) и движка образовательных сайтов [Erudit](https://github.com/erudit-js/erudit), на основе которых и работает "Открытая Математика", где вы прямо сейчас читаете этот текст.
